packages/fxa-auth-server/test/local/payments/fixtures/stripe/plan1.json

{
  "id": "plan_G93lTs8hfK7NNG",
  "object": "plan",
  "active": true,
  "aggregate_usage": null,
  "amount": 499,
  "amount_decimal": "499",
  "billing_scheme": "per_unit",
  "created": 1573274041,
  "currency": "usd",
  "interval": "month",
  "interval_count": 1,
  "livemode": false,
  "metadata": {},
  "nickname": "Basic FPN",
  "product": {
    "id": "prod_G93l8Yn7XJHYUs",
    "object": "product",
    "active": true,
    "attributes": [],
    "caption": null,
    "created": 1573274017,
    "deactivate_on": [],
    "description": null,
    "images": [],
    "livemode": false,
    "metadata": {
      "webIconURL": "https://example.com/static/icon.svg",
      "upgradeCTA": "hello <a href=\"http://example.org\">world</a>",
      "successActionButtonURL": "https://example.com/download",
      "appStoreLink": "https://example.com/appStoreRedirect",
      "playStoreLink": "https://example.com/playStoreRedirect",
      "product:privacyNoticeURL": "https://cdn.accounts.firefox.com/legal/privacy",
      "product:privacyNoticeDownloadURL": "https://cdn.accounts.firefox.com/legal/privacy.pdf",
      "product:termsOfServiceURL": "https://cdn.accounts.firefox.com/legal/terms",
      "product:termsOfServiceDownloadURL": "https://cdn.accounts.firefox.com/legal/terms.pdf",
      "capabilities:aFakeClientId12345": "more,comma,separated,values",
      "productSet": "fpn_product",
      "productOrder": "1"
    },
    "name": "FPN Tier 1",
    "package_dimensions": null,
    "shippable": null,
    "statement_descriptor": null,
    "type": "service",
    "unit_label": null,
    "updated": 1573853421,
    "url": null
  },
  "tiers": null,
  "tiers_mode": null,
  "transform_usage": null,
  "trial_period_days": null,
  "usage_type": "licensed"
}
