packages/fxa-auth-server/test/local/payments/fixtures/stripe/plan3.json

{
  "id": "plan_F4G9jB3x5i6Dpj",
  "object": "plan",
  "active": true,
  "aggregate_usage": null,
  "amount": 100,
  "amount_decimal": "100",
  "billing_scheme": "per_unit",
  "created": 1557867224,
  "currency": "usd",
  "interval": "day",
  "interval_count": 1,
  "livemode": false,
  "metadata": {},
  "nickname": "Daily Subscription",
  "product": {
    "id": "prod_EtMczoDntN9YEa",
    "object": "product",
    "active": true,
    "attributes": [],
    "caption": null,
    "created": 1555354226,
    "deactivate_on": [],
    "description": null,
    "images": [],
    "livemode": false,
    "metadata": {
      "webIconURL": "https://example.com/static/icon.svg",
      "upgradeCTA": "hello <a href=\"http://example.org\">world</a>",
      "successActionButtonURL": "https://example.com/download",
      "appStoreLink": "https://example.com/appStoreRedirect",
      "playStoreLink": "https://example.com/playStoreRedirect",
      "product:privacyNoticeURL": "https://cdn.accounts.firefox.com/legal/privacy",
      "product:privacyNoticeDownloadURL": "https://cdn.accounts.firefox.com/legal/privacy.pdf",
      "product:termsOfServiceURL": "https://cdn.accounts.firefox.com/legal/terms",
      "product:termsOfServiceDownloadURL": "https://cdn.accounts.firefox.com/legal/terms.pdf",
      "capabilities:aFakeClientId12345": "more,comma,separated,values",
      "productSet": "daily_subscription",
      "productOrder": "3"
    },
    "name": "Moz_Sub",
    "package_dimensions": null,
    "shippable": null,
    "statement_descriptor": "Moz-Sub",
    "type": "service",
    "unit_label": "Moz-Sub",
    "updated": 1573169050,
    "url": null
  },
  "tiers": null,
  "tiers_mode": null,
  "transform_usage": null,
  "trial_period_days": null,
  "usage_type": "licensed"
}
